doc/site/site.org
#+title: zfs-snap-diff
#+hugo_base_dir: .
#+options: creator:t author:nil

* Changelog
:PROPERTIES:
:export_file_name: changelog
:export_hugo_weight: 40
:export_hugo_section: docs
:END:


** 1.0.0-alpha (unreleased)

{{< hint note >}}
This version is a complete rewrite.

The backend is implemented in [[https://golang.org][Go]] (as before) and the frontend in [[http://purescript.org][PureScript]].
{{< /hint >}}

  - download a complete directory as zip-archive

  - date-range based search for file versions
    - this speeds up the scan dramatically if
      there are thousands snapshots on spinning disk

  - bookmark support
    - bookmarks are per dataset and stored in the browser ([[https://en.wikipedia.org/wiki/Web_storage][Web storage]]).

  - works now also with 'legacy' mountpoints

  - new backend and frontend code

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.10...dev][all commits from 0.0.10...dev]]

** 0.0.10

  - use relative url for service endpoints
    - to use zfs-snap-diff behind a reverse proxy
    - minimal example config snipped for nginx:

          location /zfs-snap-diff/ {
              proxy_pass http://localhost:12345/;
          }

  - optional tls encryption
  - listen address per '-l' flag configurable

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.9...0.0.10][all commits from 0.0.9...0.0.10]]

** 0.0.9

  - show file size and modify timestamp in the file-browser
  - list directories at first in the file-browser
  - sortable columns in the file-browser
  - only regular files / directories are clickable

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.8...0.0.9][all commits from 0.0.8...0.0.9]]

** 0.0.8

  * dataset selectable in 'browse-actual' view
  * add size informations to dataset (to match 'zfs list' output)
  * small fixes
  * code cleanup

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.7...0.0.8][all commits from 0.0.7...0.0.8]]

** 0.0.7

  - support sub zfs filesystems (datasets)
  - optional use sudo when execute zfs commands
    - necessary under linux when running as non root
    - needs sudo rules
    - start `zfs-snap-diff` with-'-use-sudo'
  - new view for server messages

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.6...0.0.7][all commits from 0.0.6...0.0.7]]

** 0.0.6

  - check if file in snapshot has changed filetype depend:
    - text files: md5
    - others: size+modTime
  - diffs created in the backend (per [[https://github.com/sergi/go-diff][go-diff]])
    - different presentation: intext / sid- by side
    - possibility to revert single changes

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.5...0.0.6][all commits from 0.0.5...0.0.6]]


** 0.0.5

  - file compare method configurable: size+modTime (default) or md5
  - optional limit how many snapshots are scan to search older file version
  - autohide notifications in frontend
  - show message if no snapshots found

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.4...0.0.5][all commits from 0.0.4...0.0.5]]

** 0.0.4

  - view, diff, download or restore file from a snapshot
  - view file with syntax highlight
  - browse old snapshot versions
  - easy switch "versions" per 'Older' / 'Newer' buttons
  - cleanup frontend
  - refactor backend

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.3...0.0.4][all commits 0.0.3...0.0.4]]

** 0.0.3

  - show server errors on frontend
  - show waiting spinner when loading

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.2...0.0.3][all commits 0.0.2...0.0.3]]

** 0.0.2

  - partial frontend configuration from server
  - fix firefox ui

[[https://github.com/j-keck/zfs-snap-diff/compare/0.0.1...0.0.2][all commits 0.0.1...0.0.2]]

** 0.0.1

  - prototype
